tutorials/laminar/coneCollapse/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale           1;

// domain dimensions
radius          1;
height          0.5;
cosAngle        0.99966;
sinAngle        0.02618;

trueRad         #eval{ $cosAngle * $radius };
halfW           #eval{ $sinAngle * $radius};

// number of cells and grading values
nr              100;
nz              30;           


vertices
(
    (0 0 0)  // 0
    ($trueRad -$halfW 0)  // 1
    ($trueRad $halfW 0)  // 2
    (0 0 $height)  // 3
    ($trueRad -$halfW $height)  // 4
    ($trueRad $halfW $height)  // 5
);
 
blocks
(
    hex (0 1 2 0 3 4 5 3) ($nr 1 $nz) simpleGrading (1 1 1)
);
 
edges
(
);
 
boundary
(
     front
     { 
           type wedge;
           faces  
           (
               (0 1 4 3)
           );
     }
     
     back
     { 
           type wedge;
           faces  
           (
               (0 3 5 2)
           );
     }

     top
     { 
           type wall;
           faces  
           (
               (3 4 5 3)
           );
     }
     
     bed
     { 
           type patch;
           faces  
           (
               (0 2 1 0)
           );
     }
     
     outlet
     { 
           type patch;
           faces  
           (
               (1 2 5 4)
           );
     }
     
     axis
     { 
           type empty;
           faces  
           (
               (0 3 3 0)
           );
      }
);

mergePatchPairs
(
);

// ************************************************************************* //
