tutorials/laminar/coneCollapse/system/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches ( "bed" );

boundary
{
    axisFa
    {
        type empty;
        neighbourPolyPatch axis;
    }
    frontFa
    {
        type wedge;
        neighbourPolyPatch front;
    }
    backFa
    {
	type wedge;
	neighbourPolyPatch back;
    }
    outletFa
    {
	type patch;
	neighbourPolyPatch outlet;
    }
}

defaultPatch
{
    name empty;
    type empty;
}


// ************************************************************************** //
